In [1]:
import pandas as pd
import numpy as np

In [5]:
t1 = pd.DataFrame(np.arange(12).reshape(3,4),index=list("abc"),columns=list("WXYZ"))

In [6]:
t1

   W  X   Y   Z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [7]:
dict1 = {"name":["allen","alex","tom"],"age":[18,19,20],"tel":[10086,10010,12345]}

In [8]:
d1 = pd.DataFrame(dict1)

In [9]:
d1

   age   name    tel
0   18  allen  10086
1   19   alex  10010
2   20    tom  12345

In [10]:
type(d1)

pandas.core.frame.DataFrame

In [2]:
t = pd.DataFrame(np.arange(12).reshape(3,4),index=list("abc"),columns=list("WXYZ"))

In [3]:
t

   W  X   Y   Z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [6]:
#a行z列
t.loc["a","Z"]

3

In [7]:
#a行
t.loc["a"]

W    0
X    1
Y    2
Z    3
Name: a, dtype: int32

In [9]:
# y列
t.loc[:,"Y"]

a     2
b     6
c    10
Name: Y, dtype: int32

In [12]:
#获取第一行和第三行
t.loc[["a","c"],:]

   W  X   Y   Z
a  0  1   2   3
c  8  9  10  11

In [13]:
#获取第一列和第三列
t.loc[:,["W","Y"]]

   W   Y
a  0   2
b  4   6
c  8  10

In [14]:
t.loc[["a","c"],["W","Z"]]

   W   Z
a  0   3
c  8  11

In [15]:
#判断是否有NAN
pd.isnull(t)

       W      X      Y      Z
a  False  False  False  False
b  False  False  False  False
c  False  False  False  False

In [20]:
t

   W  X   Y   Z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [29]:
t["W"]["b"]

4

In [30]:
t.loc[["b"],["W","Z"]]

   W  Z
b  4  7

In [32]:
t.loc["b","W"]

4